{"_path":"/notes/rbac","_dir":"notes","_draft":false,"_partial":false,"_locale":"","_empty":false,"title":"Understanding Role-Based Access Control (RBAC)","description":"","tittle":"RBAC","icon":"eos-icons:role-binding-outlined","body":{"type":"root","children":[{"type":"element","tag":"h1","props":{"id":"understanding-role-based-access-control-rbac"},"children":[{"type":"text","value":"Understanding Role-Based Access Control (RBAC)"}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/rbac","rel":["nofollow"]},"children":[{"type":"text","value":"refer"}]}]}]},{"type":"element","tag":"blockquote","props":{},"children":[{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Everything you need to know about RBAC in one place."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This article provides a comprehensive overview of "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"role-based access control (RBAC)"}]},{"type":"text","value":" along with a guided approach to implementing, maintaining, and extending RBAC to suit the needs of your organization. You will discover what roles are, how to define them, and how using them to govern access can help secure your network, reduce administrative overhead, and help you achieve regulatory compliance. Let’s jump in."}]},{"type":"element","tag":"h2","props":{"id":"what-is-rbac"},"children":[{"type":"text","value":"What is RBAC?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Role-based access control (RBAC) is a security approach that authorizes and restricts system access to users based on their role(s) within an organization."}]},{"type":"text","value":" This allows users to access the data and applications needed to fulfill their job requirements and minimizes the risk of unauthorized employees accessing sensitive information or performing unauthorized tasks. In addition to restricting access, RBAC can refine the way a user interacts with data—permitting read-only or read/write access to certain roles, thus limiting a user’s ability to execute commands or delete information."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"An effective system of user access control is essential for large enterprises or companies that manage a large number of contractors, vendors, and even customers. For these organizations, RBAC will protect critical data, improve operational efficiency, and help certify regulatory compliance. We’ll cover all of this later in the article. But first, let’s take a quick look at where it all began."}]},{"type":"element","tag":"h2","props":{"id":"history-of-role-based-access-control"},"children":[{"type":"text","value":"History of Role-Based Access Control"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"People have used roles and responsibilities to moderate access to commercial computer systems since at least the 1970s. However, these procedures were ad hoc and often had to be redesigned on a per-case basis for each new system."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It wasn’t until 1992 that researchers at the "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/nist-compliance","rel":["nofollow"]},"children":[{"type":"text","value":"American National Standards Institute (NIST)"}]},{"type":"text","value":" first began to formalize the system we know as role-based access control. In that year, "},{"type":"element","tag":"a","props":{"href":"https://csrc.nist.gov/CSRC/media/Projects/Role-Based-Access-Control/documents/ferraiolo-kuhn-92.pdf","rel":["nofollow"]},"children":[{"type":"text","value":"Ferraiolo and Kuhn"}]},{"type":"text","value":" laid the foundation for the model we use today in a paper outlining a general-purpose access control methodology appropriate for civilian and commercial use."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Ferraiolo, Kuhn, and others continued to refine RBAC throughout the 1990s and early 2000s, building on earlier work to explore the economic benefits of RBAC, outline a unified model, and most notably, define separation of duty forms. In 2004, NIST officially "},{"type":"element","tag":"a","props":{"href":"https://csrc.nist.gov/Projects/Role-Based-Access-Control/faqs","rel":["nofollow"]},"children":[{"type":"text","value":"adopted RBAC as an industry standard"}]},{"type":"text","value":"."}]},{"type":"element","tag":"h2","props":{"id":"the-rbac-model"},"children":[{"type":"text","value":"The RBAC Model"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There are three types of access control under the RBAC standard: core, hierarchical, and constrained."}]},{"type":"element","tag":"h3","props":{"id":"core-rbac"},"children":[{"type":"text","value":"Core RBAC"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The core model outlines the essential elements of every role-based access control system. While core RBAC can stand alone as an access control method, it also lays the foundation for both the hierarchical and constrained models."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As such, all RBAC must adhere to the following three rules:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Role assignment: A subject can exercise a permission only if the subject has selected or been assigned a role."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Role authorization: A subject’s active role must be authorized."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Permission authorization: A subject can only exercise a permission which is authorized for the subject’s active role.\n‍"}]}]},{"type":"element","tag":"h3","props":{"id":"hierarchical-rbac"},"children":[{"type":"text","value":"Hierarchical RBAC"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"By assuming your defenses have already been infiltrated, you can take a stronger security posture against potential threats, minimizing the impact if a breach does occur. Limit the “blast radius” — the extent and reach of potential damage incurred by a breach — by segmenting access and reducing your "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/attack-surface","rel":["nofollow"]},"children":[{"type":"text","value":"attack surface"}]},{"type":"text","value":", verifying end-to-end encryption, and monitoring your network in real time.\n‍"}]},{"type":"element","tag":"h3","props":{"id":"constrained-rbac"},"children":[{"type":"text","value":"Constrained RBAC"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This third RBAC standard adds separation of duties to the core model. Separation of duty relations fall under two headings: static and dynamic."}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Under Static Separation of Duty (SSD) relations, a single user cannot hold mutually-exclusive roles (as defined by the organization). This ensures, for example, that one individual cannot both make and approve a purchase."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"In the Dynamic Separation of Duty (DSD) model, a user can be a member of conflicting roles. However, the user may not function in both roles during a single session. This constraint helps control internal security threats by, for example, enforcing the two-person rule in which two distinct users are required to authorize an action."}]}]},{"type":"element","tag":"h2","props":{"id":"examples-of-role-based-access-control"},"children":[{"type":"text","value":"Examples of Role-Based Access Control"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"To see how this might work, consider an analogy (oversimplified for the sake of clarity)."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Steve oversees a youth hockey team composed of players, coaches, referees, and a concession seller. Even in this very basic organization, complex rights and responsibilities exist. Players need access to locker rooms and the ice rink, while the referee needs access only to the ice. The coach must create and share a roster of players, including contact information. The person selling concessions interacts with items for sale, processes credit cards, and collects/deposits cash. The administrator organizes the game schedule, gathers fees from players, pays coaches and refs (or organizes volunteers). And so on."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In this scenario, allocating access according to roles is a useful approach. When a new child joins the team, she is issued a player uniform and a read-only copy of the roster. She is given a game and practice schedule and the combination to her locker. Nobody has to consider whether she needs a key to the cash register or a pair of referee’s orange armbands."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The same principle can apply to businesses and other institutions. Here are a few examples of RBAC in action:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"An HR manager at a large enterprise is authorized to add, change, or delete employee records for anyone in the organization (except herself, see separation of duties) but has no access to the customer database."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"A member of the sales team at a medium-sized IT vendor is assigned a role that allows him to update the customer database, but he is unable to view the details of employee records other than his own."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"A doctor at a large hospital has access to complete patient records, while the receptionist can access only basic contact information."}]}]},{"type":"element","tag":"h2","props":{"id":"benefits-of-role-based-access-control"},"children":[{"type":"text","value":"Benefits of Role-Based Access Control"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"As you can see from these examples, RBAC provides a layer of security without interrupting peoples’ ability to do their jobs. Here are the three primary benefits of role-based access control."}]},{"type":"element","tag":"h3","props":{"id":"increases-security"},"children":[{"type":"text","value":"Increases Security"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"RBAC restricts user access to the minimum levels required to perform a job. This helps organizations enforce security best-practices like the "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/principle-of-least-privilege","rel":["nofollow"]},"children":[{"type":"text","value":"principle of least privilege"}]},{"type":"text","value":" (PoLP), which diminishes the risk of data breaches and data leakage. Should a breach occur, RBAC limits the impact by shrinking the attack surface—access to protected information will be limited to the role that the hacker used as an entry point. So, for example, an HR employee who falls victim to a phishing attack cannot expose privileged information from the finance department. Malicious attacks on any single account are stifled before they can harm other systems."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The RBAC principle of separation of duties (SoD) improves security even more by precluding any employee from having sole power to handle a task. With SoD, even bad-actors within the organization are limited in the damage they can cause."}]},{"type":"element","tag":"h3","props":{"id":"simplifies-workflows"},"children":[{"type":"text","value":"Simplifies Workflows"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"RBAC grants users the exact access needed for their roles, which helps eliminate the bottlenecks. Employees no longer have to badger admins for access to data and systems."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"And IT is freed from the mountain of busywork required to manage one-off permissions for each user."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"RBAC simplifies onboarding, offboarding, and other provisioning/deprovisioning activities. Admins can easily update permissions for existing employees who change roles within the organization or for contractors and third-party users who need temporary access to your network."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These increases in operational efficiency offer economic benefits and improve employee satisfaction. A win-win."}]},{"type":"element","tag":"h3","props":{"id":"improves-compliance"},"children":[{"type":"text","value":"Improves Compliance"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Finally, RBAC improves your compliance posture. All organizations—from health care providers and IT vendors to financial institutions—must adhere to federal, state, and local regulations for privacy and confidentiality. Additionally, compliance certifications like SOC 2 can improve brand reputation and offer a competitive advantage for businesses that regularly handle third-party data. Demonstrating compliance reflects a commitment to ensuring the security of customer data as well as the ability to protect sensitive information in general."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"RBAC provides a framework for managing and monitoring access. Administrators know who accessed a system and when, what modifications were made, and what authorizations were in effect. This helps organizations correct any issues that arise and makes it easier to meet regulatory requirements such as "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/hipaa-compliance","rel":["nofollow"]},"children":[{"type":"text","value":"HIPAA"}]},{"type":"text","value":", "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/sox-compliance","rel":["nofollow"]},"children":[{"type":"text","value":"SOX"}]},{"type":"text","value":", "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/soc2/compliance","rel":["nofollow"]},"children":[{"type":"text","value":"SOC 2"}]},{"type":"text","value":", and "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/iso-27001","rel":["nofollow"]},"children":[{"type":"text","value":"ISO 27001"}]},{"type":"text","value":", which depend on network visibility to prove that data and sensitive information have been handled according to privacy, security, and confidentiality standards."}]},{"type":"element","tag":"h2","props":{"id":"disadvantages-of-role-based-access-control"},"children":[{"type":"text","value":"Disadvantages of Role-Based Access Control"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For many users, the standard definition of RBAC as a method of restricting access conjures images of frustration and friction, and without thoughtful implementation, those outcomes may indeed come to fruition. Later in this article, we will outline how to set up and manage RBAC smoothly. But first, here are four potential disadvantages of the model."}]},{"type":"element","tag":"h3","props":{"id":"requires-business-knowledge"},"children":[{"type":"text","value":"Requires Business Knowledge"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"There is no one-size-fits-all approach to defining roles. Organizations must coordinate across departments when determining how to categorize roles and how to manage access for those roles. This requires a clear understanding of the ideal structure of the organization as well as the technical infrastructure that supports it."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In large or growing organizations, this can be a daunting task made harder when IT or security managers are expected to define roles without the help of HR or executive decision-makers. This common attempt to simplify implementation actually makes the problem worse, resulting in a misalignment with larger company goals."}]},{"type":"element","tag":"h3","props":{"id":"demands-thoughtful-implementation"},"children":[{"type":"text","value":"Demands Thoughtful Implementation"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Assigning roles can be a challenge. Is it ever the case that junior staff members need more access than their managers, or is a hierarchical structure more important? Do security teams need access to the data they are trying to secure and at what level (create/read/update/delete)? Should a user be assigned a role outside of their department in order to secure temporary access to privileged files? Numerous questions may arise, and the answers won’t always be clear."}]},{"type":"element","tag":"h3","props":{"id":"lacks-flexibility"},"children":[{"type":"text","value":"Lacks Flexibility"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"RBAC has a reputation for being too rigid, and it’s no wonder. Organizations grow, teams expand, and access needs shift. Roles you defined at the beginning of your RBAC project may no longer fit company goals. On top of that, admins face pressure to quickly onboard new hires—even those with as-yet undefined roles."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"The result? People’s roles and level of permissions may be misaligned.  For instance, a person may be given too many permissions for his or her role, assigned to too many roles, or perhaps a combination of both. While these efforts may work as a quick fix, they also create security gaps and compliance challenges—undoing the whole reason you implemented RBAC in the first place!"}]},{"type":"element","tag":"h3","props":{"id":"leads-to-role-explosion"},"children":[{"type":"text","value":"Leads to Role Explosion"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Some teams attempt to side-step the problems above by defining increasingly fine-grained roles, creating ad hoc roles as new needs emerge, or assigning too many roles to individual users. While this may ease friction in the short term, it also makes RBAC confusing and difficult to manage."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"This problem, often termed role explosion, is one of the most common objections to RBAC. It arises when real-world roles and access needs differ from those outlined in your policy documents, even in very minor ways. And roles created as a temporary fix have a habit of sticking around. Admins may forget or even purposely choose to leave these roles in place, even when the people for whom they were created leave or change jobs within the organization. The result: privilege creep and chaos."}]},{"type":"element","tag":"h2","props":{"id":"rbac-vs-abac-vs-acl-vs-pbac"},"children":[{"type":"text","value":"RBAC vs. ABAC vs. ACL vs. PBAC"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Effective access control is any method that secures your network without creating friction for users. While RBAC remains a popular approach to restricting access, you may want to consider other options. Attribute-based access control (ABAC), access control lists (ACL), and policy-based access control are three alternatives. Let’s take a look at each in turn."}]},{"type":"element","tag":"h3","props":{"id":"rbac-vs-abac"},"children":[{"type":"text","value":"RBAC vs. ABAC"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Organizations use ABAC to achieve more fine-grained access control—either as a replacement for or supplement to RBAC. Unlike RBAC, which grants access according to predefined roles, ABAC relies on a combination of attributes to match users with the resources they need to do a job."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Learn more about "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/rbac-vs-abac","rel":["nofollow"]},"children":[{"type":"text","value":"RBAC vs. ABAC | Pros, Cons, and Major Distinctions"}]}]},{"type":"element","tag":"h3","props":{"id":"rbac-vs-acl"},"children":[{"type":"text","value":"RBAC vs. ACL"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Access control lists (ACL) control or restrict the flow of traffic through a digital environment. ACL rules grant or deny access in two general categories:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Filesystem ACLs apply to files and/or directories. The ACL specifies which subject (human user or machine/system process) is allowed access to objects and what operations are allowed on those objects."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Networking ACLs apply to the network routers and switches. The ACL specifies which type of traffic can access the network and what activity is allowed."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Organizations use ACLs in tandem with VPNs to manage traffic. Doing so may improve network performance, increase security, and allow for more granular monitoring at entry and exit points. This makes ACLs suitable for securing individual users and low-level data, but it may not be the best approach to access management in most business applications."}]},{"type":"element","tag":"h3","props":{"id":"rbac-vs-pbac"},"children":[{"type":"text","value":"RBAC vs. PBAC"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Policy-Based Access Control (PBAC) is another access management strategy that focuses on authorization. Whereas RBAC restricts user access based on static roles, PBAC determines access privileges dynamically based on rules and policies. Although PBAC is fairly similar to ABAC, ABAC requires more IT and development resources (e.g., XML coding) as the number of attributes required increases."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Some key benefits of PBAC include:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"flexibility to be fine- or coarse-grained."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"ability to quickly add, remove, or amend permissions."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"environmental and contextual controls (e.g., time- or location-bound access)."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"visibility into the relationship between identities and resources."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"These benefits may make access control nimbler, especially as organizations grow and change. But every access control system will require some amount of management and thoughtful implementation."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Luckily, some advanced planning and a little elbow grease can make the task productive, successful, and even fun. Here’s how."}]},{"type":"element","tag":"h2","props":{"id":"how-to-implement-access-control-rbac-best-practices"},"children":[{"type":"text","value":"How to Implement Access Control | RBAC Best Practices"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Set yourself up for success by following these role-based access control best practices. Don’t expect IT to implement RBAC alone. Begin with a conversation across departments, and then proceed systematically to ease the transition and avoid unnecessary friction in your workforce as new systems roll out. RBAC implementation requires high-level understanding of business structure and goals. By collaborating from the start, you will be better prepared to reap the benefits of RBAC and get the most out of your efforts."}]},{"type":"element","tag":"h3","props":{"id":"develop-an-rbac-strategy"},"children":[{"type":"text","value":"Develop an RBAC Strategy"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Start by evaluating where you are. What systems, data, or processes in your organization would benefit from access control? Be sure to include any job functions, technologies, and business operations. Paint with broad strokes in the beginning. You will refine the process as you go along."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Next, consider where you want to be. Will you use RBAC to automate provisioning? Do you need a better way to control access to applications that store "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/sensitive-data","rel":["nofollow"]},"children":[{"type":"text","value":"sensitive data"}]},{"type":"text","value":"? What is your desired outcome for this process?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Finally, note any gaps you need to tackle. Are your authentication/authorization models consistent across your organization? Are there compliance or regulatory requirements you need to meet? Was there a security event that prompted you to switch to RBAC?"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Once you have mapped out your strategy, you are ready to move on to the details."}]},{"type":"element","tag":"h3","props":{"id":"inventory-your-systems"},"children":[{"type":"text","value":"Inventory Your Systems"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Make a list of every resource or service that requires access control. The list may include email, cloud apps, customer databases, shared folders on a file server, and so on."}]},{"type":"element","tag":"h3","props":{"id":"analyze-your-workforce"},"children":[{"type":"text","value":"Analyze Your Workforce"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/role-access-discovery","rel":["nofollow"]},"children":[{"type":"text","value":"Role and access discovery"}]},{"type":"text","value":" is both art and science, and collaboration across IT, HR, and executive leaders will make the process easier."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Start by grouping your workforce into roles based on shared access needs. Be sure to include both current and planned departments. At the same time, avoid the trap of defining too many roles. How many is too many? That will depend on your organization. The right number will restrict access enough to secure your systems without stifling creativity."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Larger organizations may require a more systematic method of role creation in order to avoid common pitfalls such as role explosion, role overlap, and over-reliance on exceptions. Here, we recommend a two-pronged approach."}]},{"type":"element","tag":"ol","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Evaluate roles from the top down. Business managers should design a set of roles that align with company goals and take the entire workforce into consideration. Rather than focusing on systems and technology, the top-down approach should address the functional access needs of each role."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"Concurrent with phase one, IT can begin a bottoms-up analysis, gathering information about the way users are accessing systems. Then generate roles based on this analysis."}]}]},{"type":"element","tag":"h3","props":{"id":"create-and-define-roles"},"children":[{"type":"text","value":"Create and Define Roles"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Finally, reconcile your lists. Map the result of your workforce analysis to the resources from your inventory according to the principle of least privilege. This mapping will define your roles."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"For example, you may create a Basic User role, which has access to email and Slack and applies to all users in the organization. You may create a specialist role, such as Hiring Manager, which has read/write access to the employee database. You may create an Employee Database Administrator role, which has full control of the employee database. And so on for each department."}]},{"type":"element","tag":"h3","props":{"id":"establish-a-governance-structure"},"children":[{"type":"text","value":"Establish a Governance Structure"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"In addition to defining roles, you need to establish a decision-making body to maintain them. Articulate, in writing, the project priorities and standards that serve the best interests of your organization as a whole."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Your access control policies may include:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"performance measures"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"risk-management strategies"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"role re-evaluation guidelines"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"direction regarding who maintains roles"}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"a plan to keep the policy up to date"}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Policy-based access control helps prevent role proliferation and keeps your RBAC project on track even as your company grows or conflicts between departments arise."}]},{"type":"element","tag":"h3","props":{"id":"assign-people-to-roles"},"children":[{"type":"text","value":"Assign People to Roles"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"All of that preparation has laid the groundwork for the final step: implementation. Now that you have inventoried your systems and outlined the way your workforce uses them, it is time to assign roles to your employees and begin using RBAC to manage access rights and permissions."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Larger organizations may choose to roll out RBAC in stages. Start with a small group of users, organized around a business function or department. Collect feedback and make any adjustments before moving to the next stage. This will minimize workforce disruption, help you build on small successes, and demonstrate the value of the role-based access control model."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Congratulations! You have now successfully implemented RBAC in your organization. Your next task is to keep it running smoothly."}]},{"type":"element","tag":"h2","props":{"id":"managing-role-based-access-control"},"children":[{"type":"text","value":"Managing Role-Based Access Control"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Needs change. Systems change. People come and go. The RBAC you design at the start of this project will invariably differ from the RBAC you need down the road. In the early days of implementation, keep an eye on your security status and fine-tune your roles as needed. Once you reach stability, settle into a consistent cadence of regular review—annually or quarterly depending on the needs of your organization."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Using roles simplifies the process of adding, removing, and adjusting permissions to individual users, but as your organization grows in complexity, you will need to modify your roles as well. This is where iterative adjustment and regular review come into play."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Continue to collect feedback and monitor your security status on an ongoing basis. And conduct a periodic review of roles, role assignments, and RBAC authorization. Review access logs and user feedback to discover what’s working and what may need to change."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Keep an eye out for:"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"roles with unnecessary access to a particular resource."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"users attempting to access data outside the scope of their role."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"overlapping role assignments."}]},{"type":"element","tag":"li","props":{},"children":[{"type":"text","value":"role proliferation/role explosion."}]}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"It may also be a good time to educate your workforce about security best practices. However, if you have taken all of these steps and still struggle to control access, never fear. RBAC has a few more tricks up its sleeves."}]},{"type":"element","tag":"h2","props":{"id":"extending-rbac-a-rule-based-approach"},"children":[{"type":"text","value":"Extending RBAC | A Rule-Based Approach"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Teams managing a large volume of resources, especially ephemeral ones, need more flexible access rules to keep up with their ever-changing infrastructure. But this doesn’t mean scrapping RBAC and starting over."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Rather than replacing role-based access control, you can complement it with ABAC policies.  With the flexibility that dynamic access control affords, you now are in position to scale your organization without sacrificing any prior investments made in your RBAC system.‍"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://profsandhu.com/cs5323_s17/mmm-acns12-rabac-paper.pdf","rel":["nofollow"]},"children":[{"type":"text","value":"Extending RBAC"}]},{"type":"text","value":" in this way makes it nimbler, preventing the bottlenecks and workflow disruption that follow from delays in provisioning, while maintaining the security benefit of timely revocation of unauthorized access."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Managing access in the modern cloud presents new challenges that must be met with a collaborative approach that balances network security with workforce happiness. Role-based access control simplifies user provisioning, helps satisfy audit requirements, and facilitates adherence to security best-practices such as PoLP and Zero Trust. So give it a try. The effort you put in today will yield great benefits in the long run."}]},{"type":"element","tag":"p","props":{},"children":[{"type":"text","value":"Unsure where to start? We’ve got your RBAC! Visit strongDM, and sign up for our "},{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/get-a-demo","rel":["nofollow"]},"children":[{"type":"text","value":"free, no-BS demo"}]},{"type":"text","value":" today."}]},{"type":"element","tag":"h2","props":{"id":"more-rbac-resources"},"children":[{"type":"text","value":"More RBAC Resources"}]},{"type":"element","tag":"ul","props":{},"children":[{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/ebooks/rbac-ebook","rel":["nofollow"]},"children":[{"type":"text","value":"Understanding RBAC eBook"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/rbac-vs-abac","rel":["nofollow"]},"children":[{"type":"text","value":"RBAC vs. ABAC | Pros, Cons, and Major Distinctions"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/tools/roles-and-access-discovery-workbook","rel":["nofollow"]},"children":[{"type":"text","value":"Free Role and Access Discovery Workbook"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/kubernetes-rbac-role-based-access-control","rel":["nofollow"]},"children":[{"type":"text","value":"Kubernetes Role-Based Access Control (RBAC)"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/access-management-101-roles-and-access","rel":["nofollow"]},"children":[{"type":"text","value":"Access Management 101: Understanding Roles & Access"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/getting-started-role-access-discovery","rel":["nofollow"]},"children":[{"type":"text","value":"Getting Started: Role & Access Discovery"}]}]},{"type":"element","tag":"li","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/role-access-discovery","rel":["nofollow"]},"children":[{"type":"text","value":"Role & Access Discovery | Who Has Access to What Now?"}]}]}]},{"type":"element","tag":"hr","props":{},"children":[]},{"type":"element","tag":"h2","props":{"id":"about-the-author"},"children":[{"type":"text","value":"About the Author"}]},{"type":"element","tag":"p","props":{},"children":[{"type":"element","tag":"a","props":{"href":"https://www.strongdm.com/blog/author/maile-mccarthy","rel":["nofollow"]},"children":[{"type":"text","value":"Maile McCarthy"}]},{"type":"text","value":", "},{"type":"element","tag":"strong","props":{},"children":[{"type":"text","value":"Contributing Writer and Illustrator"}]},{"type":"text","value":", has a passion for helping people bring their ideas to life through web and book illustration, writing, and animation. In recent years, her work has focused on researching the context and differentiation of technical products and relaying that understanding through appealing and vibrant language and images. She holds a B.A. in Philosophy from the University of California, Berkeley. To contact Maile, "},{"type":"element","tag":"a","props":{"href":"https://www.linkedin.com/in/maile-mccarthy/","rel":["nofollow"]},"children":[{"type":"text","value":"visit her on LinkedIn"}]},{"type":"text","value":"."}]}],"toc":{"title":"","searchDepth":2,"depth":2,"links":[{"id":"what-is-rbac","depth":2,"text":"What is RBAC?"},{"id":"history-of-role-based-access-control","depth":2,"text":"History of Role-Based Access Control"},{"id":"the-rbac-model","depth":2,"text":"The RBAC Model","children":[{"id":"core-rbac","depth":3,"text":"Core RBAC"},{"id":"hierarchical-rbac","depth":3,"text":"Hierarchical RBAC"},{"id":"constrained-rbac","depth":3,"text":"Constrained RBAC"}]},{"id":"examples-of-role-based-access-control","depth":2,"text":"Examples of Role-Based Access Control"},{"id":"benefits-of-role-based-access-control","depth":2,"text":"Benefits of Role-Based Access Control","children":[{"id":"increases-security","depth":3,"text":"Increases Security"},{"id":"simplifies-workflows","depth":3,"text":"Simplifies Workflows"},{"id":"improves-compliance","depth":3,"text":"Improves Compliance"}]},{"id":"disadvantages-of-role-based-access-control","depth":2,"text":"Disadvantages of Role-Based Access Control","children":[{"id":"requires-business-knowledge","depth":3,"text":"Requires Business Knowledge"},{"id":"demands-thoughtful-implementation","depth":3,"text":"Demands Thoughtful Implementation"},{"id":"lacks-flexibility","depth":3,"text":"Lacks Flexibility"},{"id":"leads-to-role-explosion","depth":3,"text":"Leads to Role Explosion"}]},{"id":"rbac-vs-abac-vs-acl-vs-pbac","depth":2,"text":"RBAC vs. ABAC vs. ACL vs. PBAC","children":[{"id":"rbac-vs-abac","depth":3,"text":"RBAC vs. ABAC"},{"id":"rbac-vs-acl","depth":3,"text":"RBAC vs. ACL"},{"id":"rbac-vs-pbac","depth":3,"text":"RBAC vs. PBAC"}]},{"id":"how-to-implement-access-control-rbac-best-practices","depth":2,"text":"How to Implement Access Control | RBAC Best Practices","children":[{"id":"develop-an-rbac-strategy","depth":3,"text":"Develop an RBAC Strategy"},{"id":"inventory-your-systems","depth":3,"text":"Inventory Your Systems"},{"id":"analyze-your-workforce","depth":3,"text":"Analyze Your Workforce"},{"id":"create-and-define-roles","depth":3,"text":"Create and Define Roles"},{"id":"establish-a-governance-structure","depth":3,"text":"Establish a Governance Structure"},{"id":"assign-people-to-roles","depth":3,"text":"Assign People to Roles"}]},{"id":"managing-role-based-access-control","depth":2,"text":"Managing Role-Based Access Control"},{"id":"extending-rbac-a-rule-based-approach","depth":2,"text":"Extending RBAC | A Rule-Based Approach"},{"id":"more-rbac-resources","depth":2,"text":"More RBAC Resources"},{"id":"about-the-author","depth":2,"text":"About the Author"}]}},"_type":"markdown","_id":"content:5.notes:rbac.md","_source":"content","_file":"5.notes/rbac.md","_extension":"md"}